---
kind: method
id: M:Autodesk.Revit.DB.EdgeEndPoint.Evaluate
source: html/5ac83612-a3da-02fd-57e9-ac4afac49ddd.htm
---
# Autodesk.Revit.DB.EdgeEndPoint.Evaluate Method

Evaluate the end point of the edge in 3d coordinates.

## Syntax (C#)
```csharp
public XYZ Evaluate()
```

## Returns
The end point of the edge in 3d coordinates.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Failed to evaluate the end point of the edge.